let trapezes = "Трапециевидная мышца (лат. musculus trapezius) — плоская широкая мышца, занимающая поверхностное положение в задней области шеи и в верхнем отделе спины. Трапециевидная мышца имеет форму треугольника, основанием обращённого к позвоночному столбу, а вершиной — к акромиону лопатки. Трапециевидные мышцы обеих сторон спины вместе имеют форму трапеции. Функции Верхняя часть: При фиксированном позвоночнике и голове поднимает лопатку. При фиксированной лопатке разгибает голову и шею. Средняя часть: При фиксированном позвоночнике и голове приводит лопатку к позвоночнику. При сокращении всех частей мышцы также происходит приведение лопаток. Нижняя часть: При фиксированном позвоночнике и голове опускает плечевой пояс. Упражнения Тренировка верхней части трапециевидных мышц происходит путём поднятия и опускания плеч с отягощением в руках (выполнение шрагов). Нижняя часть тренируется путём сведения-разведения лопаток спины под нагрузкой.";
let shoulder = "Плечевая мышца (лат. musculus brachialis) — лежит глубже двуглавой мышцы плеча, начинается от передней поверхности плечевой кости и от обеих межмышечных перегородок (лат. septa intermuscular brachii laterale et mediale), прикрепляется к бугристости локтевой кости (лат. tuberositas ulnae). Плечо́ — отдел верхней конечности. Оно располагается между плечевым поясом и предплечьем, и соединяется с ними посредством плечевого сустава и локтевого соответственно.";
let breast = "Большая грудная мышца (лат. musculus pectoralis major) — крупная поверхностная мышца веерообразной формы, расположенная на передней поверхности груди. Под ней находится треугольной формы малая грудная мышца.  Напряжение большой грудной мышцы при фиксированном корпусе и свободной верхней конечности вызывает сгибание плеча, приведение его к туловищу и пронацию. При поднятом плече и фиксированном корпусе — опускает поднятое плечо. При фиксированных верхних конечностях и свободном корпусе (например, при подтягиваниях), участвует в сгибании рук и подъёме туловища. Приподнимает ребра, участвуя в акте вдоха.";
let biceps = "Двуглавая мышца плеча (бицепс, лат. musculus biceps brachii) — большая мышца плеча, хорошо заметна под кожей, благодаря чему широко известна даже среди людей, плохо знакомых с анатомией. Проксимальная часть состоит из двух головок — длинной (лат. caput longum) и короткой (лат. caput breve). Длинная головка начинается от надсуставного бугорка лопатки (лат. tuberculum supraglenoidale) длинным сухожилием, которое, проходя через полость плечевого сустава, ложится в межбугорковую борозду (лат. sulcus intertubercularis) плечевой кости. Короткая головка начинается от клювовидного отростка лопатки. Обе головки соединяются, образуя брюшко, которое заканчивается сухожилием, прикрепляющимся к бугристости лучевой кости (лат. tuberositas radii). От сухожилия медиально отходит плоский пучок (лат. aponeurosis musculus biceps brachii), который вплетается в фасцию предплечья."
let forearm = "Предпле́чье — часть верхней конечности человека или животного, ограниченная сверху локтевым суставом, а снизу — запястьем. В состав предплечья входят мышцы передней группы (4 слоя) и задней группы (2 слоя). Собственная фасция предплечья со всех сторон покрывает мышцы, кости, сосудистые нервные образования, образуя 3 фасциальных пространства: переднее, наружное и заднее, которые между собой разделены фасциальными перегородками, прикрепляющимися к кости. Костную основу предплечья составляют лучевая и локтевая кости, сочленяющиеся в проксимальном, дистальном лучелоктевых суставах. Эпифиз лучевой и локтевой костей укреплены связями, а диафизы соединены межкостной перепонкой. Такое анатомическое строение предплечья дает возможность производить движения лучевой кости вокруг локтевой кнаружи (супинация) и кнутри (пронация).";
let widest = "Широчайшая мышца спины (лат. musculus latissimus dorsi) — поверхностная мышца, занимающая всю нижнюю часть спины, верхние пучки в начальной части прикрыты трапециевидной мышцей. Места прикрепления и проекция расположения правой широчайшей мышцы спины Берёт своё начало от остистых отростков последних грудных (4, реже 5—6), всех поясничных и крестцовых позвонков, от заднего отдела наружной губы подвздошного гребня, от поверхностного листка пояснично-грудной фасции и от четырёх нижних рёбер (четырьмя зубцами). В поясничной области широчайшие мышцы спины обеих сторон образуют обширный апоневроз, который сращён с пояснично-грудной фасцией. Верхние пучки идут латерально, нижние косо вверх и латерально, по ходу получает дополнительные пучки в виде 3—4 зубцов, прикрывает нижний угол лопатки и большой круглой мышцы (иногда получает дополнительный пучок от большой круглой мышцы). Затем, образуя заднюю стенку подмышечной полости прикрепляется к гребню малого бугорка (лат. crista tuberculi minoris) плечевой кости.";
let press = "Прямая мышца живота(жкт) (лат. Musculus rectus abdominis) — парная плоская длинная лентовидной формы мышца, широкая вверху и суженная внизу, располагается сбоку от срединной линии. Обе прямые мышцы отделены друг от друга белой линией живота. Начинается от лобковых костей, направляется вверх и прикрепляется к передней поверхности мечевидного отростка и к наружной поверхности хрящей V—VII рёбер. Мышечные пучки прямой мышцы живота прерываются 3-4 горизонтальными сухожильными перемычками. Прямая мышца живота Изображение Артериальное кровоснабжение. Действие мышцы сгибание туловище, боковое сгибание туловища и повышение внутрибрюшного давления Мышца-антагонист Мышца, выпрямляющая позвоночник Иннервируется Медиафайлы на Викискладе Функция: при фиксированном позвоночнике и тазовом поясе прямая мышца живота опускает рёбра, тянет грудную клетку вниз, сгибает позвоночник, при фиксированной грудной клетке поднимает таз.";
let obliqueAbdominalMuscles = "Наружная косая мышца живота (лат. Musculus obliquus externus abdominis) располагается на передней и боковой поверхностях живота и частично груди. Самая широкая из мышц живота. Мышца начинается 7-8 крупными зубцами на наружной поверхности V—XII рёбер. Наружная косая мышца живота прикрепляется к наружной губе подвздошного гребня подвздошной кости, лобковому симфизу, белой линии живота. При двустороннем сокращении наружная косая мышца живота опускает рёбра, сгибает позвоночник, в положении лёжа на спине мышца поднимает таз, при одностороннем сокращении поворачивает туловище в противоположную сторону. Мышца входит в состав мышц брюшного пресса.";
let hips = "Бедро (от лат. femur — бедренная кость) — проксимальная часть нижней конечности человека (задней конечности у животных, птиц, насекомых и т. д.) между тазобедренным и коленным суставами. Прямая мышца бедра — нижняя передняя подвздошная ость, надвертлужная борозда Медиальная широкая мышца бедра — медиальная губа шероховатой линии бедра Латеральная широкая мышца бедра — большой вертел, межвертельная линия и латеральная губа широкой линии бедра Промежуточная широкая мышца бедра — межвертельная линия бедра. Сухожилие полуперепончатой мышцы разделяется на 3 пучка, один из которых присоединяется к большеберцовой коллатеральной связке; другой образует косую подколенную связку,третий переходит в фасцию подколенной мышцы и прикрепляется к линии камбаловидной мышцы большеберцовой кости";
let quadraBiceps = "Прямая мышца бедра (лат. musculus rectus femoris) наиболее длинная из всех головок мышцы. Состоит из двух головок: прямая головка  и загнутая головка. Занимает переднюю поверхность бедра. Начинается тонким сухожилием от нижней передней ости и надвертлужной борозды подвздошной кости. В самом начале прикрыта мышцей, напрягающей широкую фасцию бедра и портняжной мышцей. Направляется вниз и переходит в узкое сухожилие, которое входит в состав общего сухожилия четырёхглавой мышцы. Достигнув большеберцовой кости сухожилие прикрепляется к большеберцовой бугристости. Ниже надколенника оно называется связкой надколенника ";
let sural = "Икроно́жная мышца (лат. Musculus gastrocnemius) — двуглавая мышца на задней поверхности голени человека. Расположена над камбаловидной мышцей, вместе с которой крепится к пятке через толстое ахиллово сухожилие. Икроножная мышца образована двумя мощными мясистыми головками — медиальной и латеральной. Более мощная медиальная головка, caput mediale, начинается от подколенной поверхности над медиальным мыщелком бедренной кости, а латеральная головка, caput laterale, — симметрично ей, но несколько ниже, над латеральным мыщелком бедренной кости.";

// ------------------вывод текста в инфо блок при нажатии на один из таргет-------------------
function showInfoTrapezes() {
    document.getElementById("text").innerHTML = trapezes;
}

function showInfoShoulder() {
    document.getElementById("text").innerHTML = shoulder;
}

function showInfoBreast() {
    document.getElementById("text").innerHTML = breast;
}

function showInfoBiceps() {
    document.getElementById("text").innerHTML = biceps;
}

function showInfoForearm() {
    document.getElementById("text").innerHTML = forearm;
}

function showInfoWidest() {
    document.getElementById("text").innerHTML = widest;
}

function showInfoWidest() {
    document.getElementById("text").innerHTML = widest;
}

function showInfoPress() {
    document.getElementById("text").innerHTML = press;
}

function showInfooBliqueAbdominalMuscles() {
    document.getElementById("text").innerHTML = obliqueAbdominalMuscles;
}

function showInfoHips() {
    document.getElementById("text").innerHTML = hips;
}

function showInfoQuadraBiceps() {
    document.getElementById("text").innerHTML = quadraBiceps;
}

function showInfoSural() {
    document.getElementById("text").innerHTML = sural;
}
// ------------------вывод текста в инфо блок при нажатии на один из таргет-------------------



// -------------------подсветка и затемнение таргетов----------------------
function showTrapezes_img() {
    document.getElementById("trapezes_img").style.display = "block";

}
function hideTrapezes_img() {
    document.getElementById("trapezes_img").style.display = "none";
}


function showImg() {
    document.getElementById("shoulder_img").style.display = "block";
}
function hideImg() {
    document.getElementById("shoulder_img").style.display = "none";
}


function showBreast_img() {
    document.getElementById("breast_img").style.display = "block";
}
function hideBreast_img() {
    document.getElementById("breast_img").style.display = "none";
}


function showBiceps_img() {
    document.getElementById("biceps_img").style.display = "block";
}
function hideBiceps_img() {
    document.getElementById("biceps_img").style.display = "none";
}


function showForearm_img() {
    document.getElementById("forearm_img").style.display = "block";
}
function hideForearm_img() {
    document.getElementById("forearm_img").style.display = "none";
}


function showPress_img() {
    document.getElementById("press_img").style.display = "block";
}
function hidePress_img() {
    document.getElementById("press_img").style.display = "none";
}


function showWidest_img() {
    document.getElementById("widest_img").style.display = "block";
}
function hideWidest_img() {
    document.getElementById("widest_img").style.display = "none";
}


function showObliqueAbdominalMuscles_img() {
    document.getElementById("obliqueAbdominalMuscles_img").style.display = "block";
}
function hideObliqueAbdominalMuscles_img() {
    document.getElementById("obliqueAbdominalMuscles_img").style.display = "none";
}


function showhips_img() {
    document.getElementById("hips_img").style.display = "block";
}
function hidehips_img() {
    document.getElementById("hips_img").style.display = "none";
}


function showQuadraBiceps_img() {
    document.getElementById("quadraBiceps_img").style.display = "block";
}
function hideQuadraBiceps_img() {
    document.getElementById("quadraBiceps_img").style.display = "none";
}


function showSural_img() {
    document.getElementById("sural_img").style.display = "block";
}
function hideSural_img() {
    document.getElementById("sural_img").style.display = "none";
}
// -------------------подсветка и затемнение таргетов----------------------
